#Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные. 
a = 5
print(type(a), id(a))
a = "hello world"
print(type(a), id(a))
a = 42.0 * 3.141592 / 2.71828
print(type(a), id(a))

# Задание №2
# Создайте в переменной data список значений разных типов перечислив их через
# запятую внутри квадратных скобок. Для каждого элемента в цикле выведите:
# ✔ порядковый номер начиная с единицы
# ✔ значение
# ✔ адрес в памяти
# ✔ размер в памяти
# ✔ хэш объекта
# ✔ результат проверки на целое число только если он положительный
# ✔ результат проверки на строку только если он положительный
# Добавьте в список повторяющиеся элементы и сравните на результаты.

data=[1,2.45,'eee',1,'eee',2.45]
for n, item in enumerate(data,1):
    s_int='Это целое число ' if isinstance(item, int) else ''
    s_str='Это строка ' if isinstance(item, str) else ''
    print(n,item,id(item), item.__sizeof__(), hash(item),s_int+s_str)


# Задание №3
# ✔ Напишите программу, которая получает целое число и возвращает
# его двоичное, восьмеричное строковое представление.
# ✔ Функции bin и oct используйте для проверки своего
# результата, а не для решения.
# Дополнительно:
# ✔ Попробуйте избежать дублирования кода
# в преобразованиях к разным системам счисления
# ✔ Избегайте магических чисел
# ✔ Добавьте аннотацию типов где это возможно
num = int(26)
b = bin(num)
o = oct(num)
print(b, o)
s=''
num1=num
while num:
    num1=num//2
    if num-num1 > num1:
        s='1'+s
    else:
        s='0'+s
    num=num1
print(s)
BIN=2
OCT=8

for div in BIN,OCT:
    num: int = 26
    res: str=''
    while num:
        cur_num=num % div
        res= str(cur_num)+res
        num//= div
    print(f'для {div} res={res}') 


# Задание №4
# ✔ Напишите программу, которая вычисляет площадь
# круга и длину окружности по введённому диаметру.
# ✔ Диаметр не превышает 1000 у.е.
# ✔ Точность вычислений должна составлять
# не менее 42 знаков после запятой.
import math
import decimal
decimal.getcontext().prec = 42 #задаю точность после запятой
D=120
print(f'Площадь круга = {decimal.Decimal(math.pi*(D**2)/2)} /n Длинна окружности ={decimal.Decimal(math.pi*D)}')



# Задание №6
# Напишите программу банкомат.
# ✔ Начальная сумма равна нулю
# ✔ Допустимые действия: пополнить, снять, выйти
# ✔ Сумма пополнения и снятия кратны 50 у.е.
# ✔ Процент за снятие — 1.5% от суммы снятия, но не менее 30 и не более 600 у.е.
# ✔ После каждой третей операции пополнения или снятия начисляются проценты - 3%
# ✔ Нельзя снять больше, чем на счёте
# ✔ При превышении суммы в 5 млн, вычитать налог на богатство 10% перед каждой
# операцией, даже ошибочной
# ✔ Любое действие выводит сумму денег

